Documents/Бланк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Бланк</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБланка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБланков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВторой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоСообщил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КакСообщил</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеМенеджераПоКачеству</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезюмеКладовщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженПоНовойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОперацииЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОперацийЧеков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоККМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБойККМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проблема</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПроблемБланков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникОбращения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбращения</Name>
							<Comment>Тип обращения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыОбращенийПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО_Покупателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>55</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСобытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЖалобы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЖалоб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер_Бланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер_Карты_ОК</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатОбращения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыРассмотренияОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизв</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИНСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСписанияВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыСписанийИВозвратов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СотрудникМенявшийТипСписанияВозврата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправленныеСМС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыОперацийЧеков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыОперацийЧеков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тип201</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип211</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип103</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип113</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип101</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип111</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип102</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип112</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип104</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тип114</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Бланк/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТоварыПриНачалеРедактированияНаСервере(НоваяСтрока, Элемент.ТекущаяСтрока, Копирование);	
	
КонецПроцедуры

&НаСервере
Процедура ТоварыПриНачалеРедактированияНаСервере(НоваяСтрока, НомСтр, Копирование)
	
	ТекСтрока = Объект.Товары.НайтиПоИдентификатору(НомСтр);
	
	Если НоваяСтрока Тогда
		
		ТекСтрока.ТипЖалобы = Справочники.ТипыЖалоб.НайтиПоКоду("16");
		ТекСтрока.РезультатОбращения = Справочники.РезультатыРассмотренияОбращений.НайтиПоКоду("6");
		ТекСтрока.ТипОбращения = Справочники.ТипыОбращенийПокупателей.НайтиПоКоду("23");
		ТекСтрока.Продавец1 = Объект.Продавец1;
		ТекСтрока.ДатаСобытия = Объект.Дата;
		
	КонецЕсли;
	
	Если Копирование Тогда
		ТекСтрока.УИНСтроки = "";
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭлОтбора = ТаблицаОбращений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("GUID_Загрузки");
	ЭлОтбора.Использование = Истина;
	ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ЗагруженПоНовойСистеме Тогда
		Элементы.ТорговаяТочка.Доступность = Ложь;
		Если (Объект.ТипОперацииЧека = Перечисления.ТипыОперацийЧеков.Тип201
			ИЛИ Объект.ТипОперацииЧека = Перечисления.ТипыОперацийЧеков.Тип211) Тогда
			Элементы.ТипОперацииЧека.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Массив101 = Новый Массив();
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип101);
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип102);
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип103);
	Массив101.Добавить(Перечисления.ТипыОперацийЧеков.Тип104);
	
	Массив111 = Новый Массив();
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип111);
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип112);
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип113);
	Массив111.Добавить(Перечисления.ТипыОперацийЧеков.Тип114);
	
	Элементы.ТипОперацииЧека.СписокВыбора.Добавить(Объект.ТипОперацииЧека);
	
	Если Массив101.Найти(Объект.ТипОперацииЧека) <> Неопределено Тогда
		Для Каждого ЭлМас Из Массив101 Цикл
			Если ЭлМас = Объект.ТипОперацииЧека Тогда
				Продолжить;
			КонецЕсли;	
			Элементы.ТипОперацииЧека.СписокВыбора.Добавить(ЭлМас);
		КонецЦикла;	
	КонецЕсли;
	
	Если Массив111.Найти(Объект.ТипОперацииЧека) <> Неопределено Тогда
		Для Каждого ЭлМас Из Массив111 Цикл
			Если ЭлМас = Объект.ТипОперацииЧека Тогда
				Продолжить;
			КонецЕсли;	
			Элементы.ТипОперацииЧека.СписокВыбора.Добавить(ЭлМас);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
